Revit 2026 API

# PreviewFamilyVisibilityMode Enumeration

---

Modes that control visibility of family elements depending on the currently applied Element Visibility Settings of a view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PreviewFamilyVisibilityMode
```
```vb
Public Enumeration PreviewFamilyVisibilityMode
```
```cpp
public enum class PreviewFamilyVisibilityMode
```
```fsharp
type PreviewFamilyVisibilityMode
```

| Member name | Value | Description |
| --- | --- | --- |
| Off | 0 | Element Visibility is not applied. All family elements visible. |
| On | 1 | Element Visibility of a view is applied to show visible elements only. Elements that are cut by a reference plane will be shown with their respective cut geometry. |
| Uncut | 2 | Element Visibility of a view is applied to show elements visible if instance is not cut. Note that this state is only available in certain views, such as floor plan and ceilings. |

Values of this mode can be set or obtained for any view that supports it by accessing the [!:Autodesk::Revit::DB::TemporaryViewModes::PreviewFamilyVisibility] property.

#### Reference

Autodesk.Revit.DB Namespace